app/controllers/articles_controller.rb

  def show
    @article = Article.find params[:id]
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @article = Article.new article_params
    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "article 1"], ["text", "What an amazing article!"], ["created_at", "2018-03-04 11:26:54.256296"], ["updated_at", "2018-03-04 11:26:54.256296"]]